src/Documents/ПлатежноеПоручение/ПлатежноеПоручение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручение</name>
  <comment>периодичность день обязательна</comment>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДелам</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>DocumentRef.Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>БанкКонтрагента</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>21</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СводныйПлатеж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПлатежноеПоручение</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПлатежноеПоручение/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Add("Номер");
	Поля.Add("Дата");
	Поля.Add("Сумма");
	Поля.Add("Плательщик");
	Поля.Add("ПлательщикСтрокой");
	Поля.Add("НазначениеПлатежа");
	СтандартнаяОбработка = false;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = "Платеж №"+Данные.Номер + " от " + Format(Данные.Дата, "ДФ=dd.MM.yyyy") 
		+ " ="+ Format(Данные.Сумма, "ЧРД=.; ЧГ=0") 
		+  "руб. " + ?(ValueIsFilled(Данные.Плательщик), Данные.Плательщик, Данные.ПлательщикСтрокой)
		+ ?(StrLen(Данные.НазначениеПлатежа)>0,":"+Данные.НазначениеПлатежа, "");
		
	СтандартнаяОбработка = false;
КонецПроцедуры
